{
  "meta": {
    "lastModified": "2024-03-06T18:37:27.276Z"
  },
  "basics": {
    "label": "Cloud Security Engineer",
    "email": "dvaneson@gmail.com",
    "website": "https://dvaneson.com",
    "other": [],
    "name": "Donovan Ellison",
    "summary": "",
    "picture": "",
    "location": {
      "city": "Portland",
      "countryCode": "USA",
      "region": "OR"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Donovan Ellison",
        "url": "https://www.linkedin.com/in/donovan-ellison-631825182"
      },
      {
        "network": "GitHub",
        "username": "dvaneson",
        "url": "https://github.com/dvaneson"
      }
    ]
  },
  "work": [
    {
      "company": "Apree Health",
      "position": "Cloud Security Engineer",
      "startDate": "2022-1-10",
      "endDate": "",
      "summary": "",
      "highlights": [
        "Led the initiative to optimize Terraform pipelines, slashing wait times due to handoffs from 2 hours to just 30 minutes, resulting in significant time savings for both approvers and requesters.",
        "Successfully implemented egress filtering for URLs in PHI environments, a pivotal step in achieving HITRUST certification. Orchestrated the deployment of DiscrimiNAT across 6 VPCs, effectively filtering traffic in 27 environments with over 900 unique FQDNs.",
        "Developed a Python Flask application empowering developers to create temporary egress firewall rules in lower environments, circumventing the 24-hour SLA for FQDN additions. This innovation saved thousands of engineering hours, allowing uninterrupted development and testing.",
        "Revived and optimized scrum practices within the security team, taking a leadership role in restarting meetings and configuring Jira boards.",
        "Introduced sprint planning, backlog grooming, and retrospective sessions, resulting in an outstanding 77% reduction in Lead Time for ticket completion, from an average of 61.3 days to just 13.8 days after 3 months."
      ]
    },
    {
      "company": "Zapproved",
      "position": "Site Reliability Engineer",
      "startDate": "2021-3-29",
      "endDate": "2022-1-7",
      "summary": "",
      "highlights": [
        "Designed and implemented an AWS solution for managing SSH keys on TeamCity agents across multiple AWS accounts.",
        "Analyzed and resolved an Elasticsearch cluster issue that caused day long logging outages, sometimes multiple times a week.",
        "Spearheaded the refactoring of the Kubernetes solution. Documented the current state of the Kubernetes solution by updating, creating, and re-organizing several dozen internal documents.",
        "Developed a roadmap for Kubernetes improvements by evaluating different tools, researching best practices, creating proof of concepts, and meeting with key stakeholders."
      ]
    }
  ],
  "education": [
    {
      "institution": "Portland State University",
      "startDate": "2016-09-01",
      "endDate": "2020-08-01",
      "area": "Computer Science, University Honors",
      "studyType": "Bachelor of Science"
    }
  ],
  "projects": [
    {
      "name": "Functional Programming for Systems Software",
      "description": "",
      "highlights": [
        "Published an assessment of Habit, an experimental functional language for low-level programming.",
        "Compared Habit with C by implementing a page table in both languages.",
        "Used x86 Assembly to enable IA-32 paging and setup system calls."
      ],
      "startDate": "2020-04-01",
      "endDate": "2020-08-21",
      "url": "https://pdxscholar.library.pdx.edu/honorstheses/947/",
      "roles": [
        null
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "keywords": [
        "Python",
        "CSS",
        "HTML",
        "JavaScript"
      ]
    },
    {
      "name": "Technologies",
      "keywords": [
        "Ansible",
        "AWS",
        "GCP",
        "Docker",
        "Kubernetes",
        "Terraform",
        "Jira",
        "Jenkins"
      ]
    },
    {
      "name": "Certifications",
      "keywords": [
        "Certified Kubernetes Administrator (CKA)",
        "GIAC Cloud Security Automation Certification (GCSA)"
      ]
    }
  ],
  "volunteer": [],
  "interests": [],
  "languages": []
}